# GradientBackgroundSettings Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GradientBackgroundSettings Members
GradientBackgroundSettings Class Methods Properties See Also
---
The GradientBackgroundSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from BackgroundSettings.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GroundColor | The color of the ground. |
| HorizonColor | The color of the horizon. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from BackgroundSettings.) |
| SkyColor | The color of the top of the sky. |

# See Also
GradientBackgroundSettings Class
Autodesk.Revit.DB Namespace